{
  "name": "Yucheng Shi",
  "current": "Undergraduate student at University of Michigan",
  "information": {
    "address": {
      "city": "Ann Arbor",
      "state": "MI",
      "post": "48105",
      "street": "3020 Bolgos Cir."
    },
    "email": {
      "username": "yuchengs",
      "server": "umich.edu"
    },
    "phonebase64": "NzM0LTM1Mi05ODM4Cg=="
  },
  "summary": "I am an undergraduate student major in Honor Mathematics and Computer Science at University of Michigan - Ann Arbor. After my upcoming graduation (2019.05), I will go to graduate school, studying mathematics at University of Chicago. My research interests includes: cryptography, algebraic number theory and combinatorics. Prior to University of Chicago and University of Michigan, I receive another B.Eng. (ECE) at Shanghai Jiao Tong University. ",
  "courses": [
    {
      "title": "Advanced Linear Algebra",
      "subtitle": "Math 420",
      "location": "U-M",
      "information":"Topics are selected from: vector spaces over arbitrary fields (including finite fields); linear transformations, bases, and matrices; inner product spaces, duals and spaces of linear transformations, theory of determinants, eigenvalues and eigenvectors; applications to linear differential equations; bilinear and quadratic forms; spectral theorem; Jordan Canonical Form, least squares, singular value theory.",
      "instructor": "Robert Griess",
      "textbook": "Linear Algebra, Kenneth Hoffman, 2nd Edition"
    },
    {
      "title": "Advanced Calculus I",
      "subtitle": "Math 451",
      "location": "U-M",
      "information": "Topics covered include: logic and techniques of proofs; sets, functions, and relations; cardinality; the real number system and its topology; infinite sequences, limits, and continuity; differentiation; integration, the Fundamental Theorem of Calculus, infinite series; sequences and series of functions.",
      "instructor": "Robert Griess",
      "textbook": "Linear Algebra, Kenneth Hoffman, 2nd Edition"
    },
    {
      "title": "Mathematical Models",
      "subtitle": "Math 462",
      "location": "U-M",
      "information": "Construction and analysis of mathematical models in physics, engineering, economics, biology, medicine, and social sciences. Content varies consider- ably with instructor. Recent versions: Use and theory of dynamical systems (chaotic dynamics, ecological and biological models, classical mechanics), and mathematical models in physiology and population biology.",
      "categories": {

      }
    },
    {
      "title": "Introduction to Combinatorics",
      "subtitle": "Math 465",
      "location": "U-M",
      "information": "An introduction to combinatorics, covering basic counting techniques (inclusion-exclusion, permutations and combinations, generating functions) and fundamentals of graph theory (paths and cycles, trees, graph coloring). Additional topics may include partially ordered sets, recurrence relations, partitions, matching theory, and combinatorial algorithms.",
      "categories": {

      }
    },
    {
      "title": "Honors Algebra I",
      "subtitle": "Math 493",
      "location": "U-M",
      "information": "The course covers basic definitions and properties of groups, fields, and vector spaces including homomorphisms, isomorphisms, subgroups, and bilinear forms. Further topics are selected from: Sylow theorems; structure theorem for finitely-generated abelian groups; permutation representation; the symmetric and alternating groups; vector spaces over arbitrary fields; spectral theorem; and linear groups",
      "categories": {

      }
    },
    {
      "title": "Honors Algebra II",
      "subtitle": "Math 494",
      "location": "U-M",
      "information": "This course is a continuation of Math 493 (Honors Algebra I).  It covers basic definitions and properties of rings and modules including quotients, ideals, factorization, and field extensions. Further topics are selected from: representation theory; structure theory of modules over a PID; Jordan canonical form; Galois theory, Nullstellensatz; finite fields; Euclidean, Principal ideals, and unique factorization domains; polynomial rings in one and several variables; and algebraic varieties.",
      "categories": {

      }
    },
    {
      "title": "Probability Theory",
      "subtitle": "Math 525",
      "location": "U-M",
      "information": "The following topics will be covered: sample space and events, random variables, concept and definition of probability and expectation, conditional probability and expectation, independence, moment generating functions, Law of large numbers, Central limit theorem, Markov chains, Poisson process and exponential distribution.",
      "categories": {

      }
    },
    {
      "title": "Discrete State Stochastic Processes",
      "subtitle": "Math 526",
      "location": "U-M",
      "information": "The material is divided between discrete and continuous time processes. In both, a general theory is developed and detailed study is made of some special classes of processes and their applications. Some specific topics include generating functions; recurrent events and the renewal theorem; random walks; Markov chains; branching processes; limit theorems; Markov chains in continuous time with emphasis on birth and death processes and queueing theory; an introduction to Brownian motion; stationary processes and martingales.",
      "categories": {

      }
    },
    {
      "title": "Introduction to Complex Variables",
      "subtitle": "Math 555",
      "location": "U-M",
      "information": "Differentiation and integration of complex-valued functions of a complex variable, series, mappings, residues, applications. Evaluation of improper real integrals, applications in ideal fluid dynamics. This corresponds to Chapters 1-9 of Churchill & Brown.",
      "categories": {

      }
    },
    {
      "title": "Introduction to Coding Theory",
      "subtitle": "Math 567",
      "location": "U-M",
      "information": "Introduction to coding theory focusing on the mathematical background for error-correcting codes. Topic include: Shannon’s Theorem and channel capacity; review of tools from linear algebra and an introduction to abstract algebra and finite fields; basic examples of codes such and Hamming, BCH, cyclic, Melas, Reed-Muller, and Reed-Solomon; introduction to decoding starting with syndrome decoding and covering weight enumerator polynomials and the Mac-Williams Sloane identity.  Further topics range from asymptotic parameters and bounds to a discussion of algebraic geometric codes in their simplest form.",
      "categories": {

      }
    },
    {
      "title": "Introduction to Theory of Numbers",
      "subtitle": "Math 575",
      "location": "U-M",
      "information": "This is a first course in number theory. Topics covered include divisibility and prime numbers, congruences, quadratic reciprocity, quadratic forms, arithmetic functions, and Diophantine equations. Other topics may be covered as time permits or by request.",
      "categories": {

      }
    },
    {
      "title": "Data Structures and Algorithms",
      "subtitle": "EECS 281",
      "location": "U-M",
      "information": "Introduction to algorithm analysis and O-notation; Fundamental data structures including lists, stacks, queues, priority queues, hash tables, binary trees, search trees, balanced trees and graphs; searching and sorting algorithms; recursive algorithms; basic graph algorithms; introduction to greedy algorithms and divide and conquer strategy. Several programming assignments.",
      "categories": {

      }
    },
    {
      "title": "Introduction to Computer Organization",
      "subtitle": "EECS 370",
      "location": "U-M",
      "information": "Basic concepts of computer organization and hardware. Instructions executed by a processor and how to use these instructions in simple assembly-language programs. Stored-program concept. Datapath and control for multiple implementations of a processor. Performance evaluation, pipelining, caches, virtual memory, input/output.",
      "categories": {

      }
    },
    {
      "title": "Foundations of Computer Science",
      "subtitle": "EECS 376",
      "location": "U-M",
      "information": "Introduction to theory of computation.  Models of computation: finite state machines, Turing machines.  Decidable and undecidable problems.  Polynomial time computability and paradigms of algorithm design.  computational complexity emphasizing NP-hardness.  Coping with intractability.  Exploiting intractability:  cryptography.",
      "categories": {

      }
    },
    {
      "title": " Introduction to Computer Security",
      "subtitle": "EECS 388",
      "location": "U-M",
      "information": "This course introduces the principles and practices of computer security as applied to software, host systems, and networks. It covers the foundations of building, using and managing secure systems. Topics include standard cryptographic functions and protocols, threats and defenses for real-world systems, incident response and computer forensics. There will be homework exercises, programming projects and a final exam",
      "categories": {

      }
    },
    {
      "title": "Mobile App Development for Entrepreneurs",
      "subtitle": "EECS 441",
      "location": "U-M",
      "information": "Best practices in the software engineering of mobile applications and best practices of software entrepreneurs in the design, production and marketing of mobile apps. Students will engage in the hands-on practice of entrepreneurship by actually inventing, building and marketing their own mobile apps.",
      "categories": {

      }
    },
    {
      "title": "Introduction to Machine Learning",
      "subtitle": "EECS 445",
      "location": "U-M",
      "information": "Theory and implementation of state-of-the-art machine learning algorithms for large-scale real-world applications. Topics include supervised learning (regression, classification, kernel methods, neural networks, and regularization) and unsupervised learning (clustering, density estimation, and dimensionality reduction).",
      "categories": {

      }
    },
    {
      "title": "Introduction to Operating Systems",
      "subtitle": "EECS 482",
      "location": "U-M",
      "information": "Operating system design and implementation: multi-tasking; concurrency and synchronization; inter-process communication; deadlock; scheduling; resource allocation; memory and storage management; input-output; file systems; protection and security. Students write several substantial programs dealing with concurrency and synchronization in a multi-task environment, with file systems and with memory management.",
      "categories": {

      }
    },
    {
      "title": "Database Management Systems",
      "subtitle": "EECS 484",
      "location": "U-M",
      "information": "Concepts and methods for the design, creation, query and management of large enterprise databases. Functions and characteristics of the leading database management systems. Query languages such as SQL, forms, embedded SQL, and application development tools. Database design, integrity, normalization, access methods, query optimization, transaction management and concurrency control and recovery.",
      "categories": {

      }
    },
    {
      "title": "Web Systems",
      "subtitle": "EECS 485",
      "location": "U-M",
      "information": "Concepts surrounding web systems, applications, and internet scale distributed systems.  Topics covered include client/server protocols, security, information retrieval and search engines, scalable data processing, and fault tolerant systems.  The course has substantial projects involving development of web applications and web systems.",
      "categories": {

      }
    }

  ],
  "studies": [
    {
      "institute": "University of Michigan - Ann Arbor",
      "logo": "https://umich.edu/skins/um2013/media/images/umich-logo.png",
      "url": "https://umich.edu",
      "title": "B.S. Honor Mathematics, B.S. Computer Science",
      "durationInYears": "5",
      "graduationYear": 2019
    },
    {
      "institute": "Shanghai Jiaotong University",
      "logo": "https://www.commonapp.org/files/styles/400-y/public/school/logo/umich-shanghai-logo.jpg",
      "url": "http://en.sjtu.edu.cn/",
      "title": "B.Eng. Electrical Computer Engineering",
      "durationInYears": "4",
      "graduationYear": 2018
    }
  ],
  "projects": [
    {
      "projectName": "A Visual Approach to Complex Analysis",
      "duration": "Sep 2018 – present",
      "location": "University of Michigan",
      "description": "Use an interactive complex function visualizer that allows the position of the mouse to be used as an input of a second complex variable into function. As moving the mouse around the screen, a four (real) dimensional object, two dimensions at a time is obtained.",
      "files": [
        {
          "filename": "poster",
          "src": "./share/LoG.pdf"
        }
      ]
    },
    {
      "projectName": "Vector Information Pick up from Tire 2D Cross Sections",
      "duration": "May 2018 – August 2018",
      "location": "Shanghai Jiaotong University",
      "description": "Wrote Python codes to extract rough contours from images of tire 2D cross sections. Used OpenCV to refine the rough contours. Extracted other information such as key points and belt plies based on the refined rough contours.",
      "files": [
        {
          "filename": "report",
          "src": "./share/450.pdf"
        }
      ]
    },
    {
      "projectName": "Error Correcting Codes and Cyptography",
      "duration": "May 2017 – August 2017",
      "location": "Shanghai Jiaotong University",
      "description": "Discussed the mechanism underlying error correcting codes used in public key cryptography. Formulated the mechanism using advanced mathematics tools. Implemented a simplified Sidelnikov’s cryptosystem (a public key cryptography system based on error correcting codes) using C.",
      "files": [
        {
          "filename": "report",
          "src": "./share/ECC.pdf"
        }
      ]
    },
    {
      "projectName": "NBA games prediction",
      "duration": "Jan 2018 – April 2018",
      "location": "University of Michigan, Ann Arbor",
      "description": "Formulated a math model to predict NBA games outcome. Used k-nearest neighbor, SVM, random forest and gradient tree boosting to predict the game outcomes separately. Analyzed the performance of these methods.",
      "files": [
        {
          "filename": "report",
          "src": "./share/NBA.pdf"
        }
      ]
    }
  ],
  "experiences": [
    {
      "companyName": "University of Michigan Lab of Geometry",
      "logo": "https://umich.edu/skins/um2013/media/images/umich-logo.png",
      "url": "https://sites.lsa.umich.edu/logm/",
      "roles": [
        {
          "title": "Researcher",
          "description": "Generalize Marden's Theorem into higher dimension",
          "startDate": "2018-09-01",
          "currentJob": true,
          "location": "Ann Arbor, Michigan"
        }
      ]
    },
    {
      "companyName": "Shanghai Jiaotong University",
      "logo": "https://www.commonapp.org/files/styles/400-y/public/school/logo/umich-shanghai-logo.jpg",
      "url": "http://en.sjtu.edu.cn/",
      "roles": [
        {
          "title": "Teaching Assistant for Calculus III",
          "description": "Grade homework, lead discussion classes, hold office hours",
          "startDate": "2016-05-01",
          "endDate": "2016-08-31",
          "location": "Shanghai"
        },
        {
          "title": "Teaching Assistant for Calculus II",
          "description": "Grade homework, lead discussion classes, hold office hours",
          "startDate": "2015-09-01",
          "endDate": "2015-12-31",
          "location": "Shanghai"
        }
      ]
    },
    {
      "companyName": "Guotai Junan Securityies Co., Ltd",
      "logo": "https://media.glassdoor.com/sqls/565499/guotai-junan-securities-squarelogo-1426056022791.png",
      "url": "https://www.gtja.com/en/index2.html",
      "roles": [
        {
          "title": "Internship",
          "description": "Write scripts to collect data related to film industry",
          "startDate": "2017-05-01",
          "endDate": "2017-08-01",
          "location": "Shanghai"
        }
      ]
    }
  ],
  "misc": ""
}
